In [24]:
!type C:\Users\wpx\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [27]:
import pandas as pd
df = pd.read_csv(r'C:\Users\wpx\examples\ex1.csv')

In [28]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
pd.read_table(r'C:\Users\wpx\examples\ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [31]:
!type C:\Users\wpx\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [37]:
pd.read_csv(r'C:\Users\wpx\examples\ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [35]:
pd.read_csv(r'C:\Users\wpx\examples\ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
names = ['a', 'b', 'c', 'd', 'message']

In [39]:
pd.read_csv(r'C:\Users\wpx\examples\ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [41]:
!type C:\Users\wpx\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [43]:
parsed = pd.read_csv(r'C:\Users\wpx\examples\csv_mindex.csv', index_col=['key1', 'key2'])

In [44]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [45]:
list(open(r'C:\Users\wpx\examples\ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [46]:
result = pd.read_table(r'C:\Users\wpx\examples\ex3.txt', sep='\s+')

In [47]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [48]:
!type C:\Users\wpx\examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [50]:
pd.read_csv(r'C:\Users\wpx\examples\ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [51]:
!type C:\Users\wpx\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [52]:
result = pd.read_csv(r'C:\Users\wpx\examples\ex5.csv')

In [53]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [54]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [55]:
result = pd.read_csv(r'C:\Users\wpx\examples\ex5.csv', na_values=['NULL'])

In [56]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [57]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [58]:
pd.read_csv(r'C:\Users\wpx\examples\ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [60]:
pd.options.display.max_rows = 10

In [61]:
result = pd.read_csv(r'C:\Users\wpx\examples\ex6.csv')

In [62]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [63]:
pd.read_csv(r'C:\Users\wpx\examples\ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [64]:
chunker = pd.read_csv(r'C:\Users\wpx\examples\ex6.csv', chunksize=1000)

In [65]:
chunker

In [66]:
chunker = pd.read_csv(r'C:\Users\wpx\examples\ex6.csv', chunksize=1000)

In [69]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [70]:
tot[:10]

E    336.0
X    327.0
L    315.0
M    309.0
K    303.0
Q    301.0
O    299.0
P    299.0
J    298.0
F    295.0
dtype: float64

In [73]:
data = pd.read_csv(r'C:\Users\wpx\examples\ex5.csv')

In [74]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [76]:
data.to_csv(r'C:\Users\wpx\examples\out.csv')

In [77]:
!type C:\Users\wpx\examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [78]:
import sys

In [79]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [80]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [81]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [82]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [84]:
dates = pd.date_range('1/1/2000', periods=7)

In [86]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [87]:
ts.to_csv(r'C:\Users\wpx\examples\tseries.csv')

In [88]:
!type C:\Users\wpx\examples\tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [89]:
!type C:\Users\wpx\examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [91]:
import csv
f = open(r'C:\Users\wpx\examples\ex7.csv')
reader = csv.reader(f)

In [92]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [93]:
with open(r'C:\Users\wpx\examples\ex7.csv') as f:
    lines = list(csv.reader(f))

In [94]:
header, values = lines[0], lines[1:]

In [95]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [96]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [5]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age":30, "pets": ["Zeus", "Zuko"]},
               {"name": "Katie", "age":38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [6]:
import json

In [7]:
result = json.loads(obj)

In [8]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [9]:
asjson = json.dumps(result)

In [12]:
import pandas as pd
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [13]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [14]:
!type C:\Users\wpx\examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [16]:
data = pd.read_json(r'C:\Users\wpx\examples\example.json')

In [17]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [19]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [20]:
tables = pd.read_html(r'C:\Users\wpx\examples\fdic_failed_bank_list.html')

In [21]:
len(tables)

1

In [22]:
failures = tables[0]

In [23]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [24]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [25]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [26]:
from lxml import objectify

In [29]:
from io import StringIO

In [33]:
tag = r'<a href="http://www.google.com">Google</a>'

In [34]:
root = objectify.parse(StringIO(tag)).getroot()

In [35]:
root

In [36]:
root.get('href')

'http://www.google.com'

In [37]:
root.text

'Google'

In [38]:
frame = pd.read_csv(r'C:\Users\wpx\examples\ex1.csv')

In [39]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [40]:
frame.to_pickle(r'C:\Users\wpx\examples\frame_pickle')

In [41]:
pd.read_pickle(r'C:\Users\wpx\examples\frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [43]:
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})

In [44]:
store = pd.HDFStore('mydata.h5')

In [45]:
store['obj1'] = frame

In [46]:
store['obj1_col'] = frame['a']

In [47]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [48]:
store['obj1']

           a
0   1.428523
1   0.254108
2  -0.138506
3  -0.244927
4   0.471056
..       ...
95  0.868233
96 -1.348577
97  0.683661
98  1.239699
99 -1.834965

[100 rows x 1 columns]

In [49]:
store.put('obj2', frame, format='table')

In [50]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.835252
11  0.510862
12  1.571992
13  0.485015
14  1.059249
15 -0.057388

In [51]:
store.close()

In [52]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [54]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.428523
1  0.254108
2 -0.138506
3 -0.244927
4  0.471056

In [58]:
xlsx = pd.ExcelFile(r'C:\Users\wpx\examples\ex1.xlsx')

In [59]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [60]:
frame = pd.read_excel(r'C:\Users\wpx\examples\ex1.xlsx', 'Sheet1')

In [61]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [62]:
writer = pd.ExcelWriter(r'C:\Users\wpx\examples\ex2.xlsx')

In [63]:
frame.to_excel(writer, 'Sheet1')

In [64]:
writer.save()

In [65]:
frame.to_excel(r'C:\Users\wpx\examples\ex2.xlsx')

In [66]:
import requests

In [70]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [71]:
resp = requests.get(url)

In [72]:
resp

In [74]:
data = resp.json()

In [75]:
data[0]['title']

'ENH: parse_dates in read_csv should not fail silently'

In [76]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [77]:
issues

,number,title,labels,state
0,35520,ENH: parse_dates in read_csv should not fail s...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
1,35519,"REF: StringArray._from_sequence, use less memory",[],open
2,35518,BUG: Pandas 1.0.5 → 1.1.0 behavior change on D...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,35517,BUG: Pandas 1.0.5 → 1.1.0 behavior change on D...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
4,35516,BUG: Error with std of nullable column obtaine...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
5,35515,CLN: get_flattened_iterator,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
6,35514,BUG: fix combine_first converting timestamp to...,[],open
7,35513,BUG: RollingGroupby respects __getitem__,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,35510,REGR: Check for float in isnaobj_old,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
9,35509,BUG: Possible Regression in DatetimeIndex Slicing,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
10,35507,Added paragraph on creating DataFrame from lis...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
11,35505,DOC: ExcelWriter constructor types,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
12,35504,TST: ensure that DataFrameGroupBy.apply does n...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
13,35499,"BUG: pandas 1.1.0 MemoryError using .astype(""s...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,35498,BUG: Index.get_indexer_non_unique misbehaves w...,[],open
15,35497,BUG: Issue with latest version of pandas (1.1.0),"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,35496,Fix numpydev CI failure,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
17,35494,TST: GroupBy on 2 rows of MultiIndex returns c...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
18,35493,BUG: use_inf_as_na options raises value error ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,35492,DOC: Add note to docstring DataFrame.compare a...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
20,35491,DOC: Add note to DataFrame.compare about only ...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
21,35490,BUG: DataFrame.agg with multiple cum functions...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
22,35489,RLS: 1.1.1,"[{'id': 131473665, 'node_id': 'MDU6TGFiZWwxMzE...",open
23,35488,BUG: Shift on DataFrame which has more than 1 ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,35487,ENH: Add different reference epochs for to_jul...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
25,35486,QST: is the new behavior of GroupByRolling in ...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
26,35485,MAINT: Fix broadcasting of arrays,[],open
27,35484,BUG: read_sql no longer works simply with SqlA...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,35482,ENH: add tseries.offsets prefix_mapping to pub...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,35481,Numpydev CI Failures,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open

In [78]:
import sqlite3

In [79]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [80]:
con = sqlite3.connect('mydata.sqlite')

In [81]:
con.execute(query)

In [93]:
con.commit()

In [94]:
cursor = con.execute('select * from test')

In [96]:
rows = cursor.fetchall()

In [97]:
rows

[]